data_assignment/foam_cases/13_1deg_unrefined/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type            calculated;
        value           uniform 0;
    }

    Airfoil
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    
    Flap
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
    
    Side
    {
        type empty;
    }
    
    Outlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
