data_assignment/foam_cases/13_1deg_unrefined/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    Inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.01;
        value           $internalField;
    }
    
    Outlet
    {
        type zeroGradient;
    }

    Airfoil
    {
        type            kqRWallFunction;
    }
    
    Flap
    {
        type            kqRWallFunction;
    }
    
    Side
    {
        type empty;
    }

}


// ************************************************************************* //
